# StairsSubElementsNotConnectedWarning Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsSubElementsNotConnectedWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Stair sub-elements are not connected
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsSubElementsNotConnectedWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsSubElementsNotConnectedWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsSubElementsNotConnectedWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace